windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UART();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D14, peripheral: WDOG1, signal: wdog_b, pin_signal: GPIO_B1_13, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: J12, peripheral: ADC1, signal: 'IN, 11', pin_signal: GPIO_AD_B1_06, identifier: MUX_ADC1, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: K10, peripheral: ADC2, signal: 'IN, 12', pin_signal: GPIO_AD_B1_07, identifier: MUX_ADC2, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: D7, peripheral: TMR1, signal: 'TIMER, 0', pin_signal: GPIO_B0_00, identifier: COUPLING_SIG1, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: M11, peripheral: TMR1, signal: 'TIMER_INPUT, 1', pin_signal: GPIO_AD_B0_02, identifier: TMR_TRIG1, slew_rate: Fast}
  - {pin_num: A13, peripheral: TMR2, signal: 'TIMER, 3', pin_signal: GPIO_B1_09, identifier: LED_CELL_EN, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: M11, peripheral: TMR2, signal: 'TIMER_INPUT, 1', pin_signal: GPIO_AD_B0_02, identifier: TMR_TRIG2}
  - {pin_num: J11, peripheral: TMR3, signal: 'TIMER, 0', pin_signal: GPIO_AD_B1_00, identifier: AN_SW_EN1, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: M11, peripheral: TMR3, signal: 'TIMER_INPUT, 1', pin_signal: GPIO_AD_B0_02, identifier: TMR_TRIG3, speed: MHZ_200}
  - {pin_num: M11, peripheral: TMR4, signal: 'TIMER_INPUT, 1', pin_signal: GPIO_AD_B0_02, identifier: TMR_TRIG4}
  - {pin_num: H14, peripheral: GPIO1, signal: 'gpio_io, 14', pin_signal: GPIO_AD_B0_14, identifier: DEBUG_TP1, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: L10, peripheral: GPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AD_B0_15, identifier: DEBUG_TP2, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: M12, peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03, identifier: ADD_MUX11, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: L12, peripheral: GPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AD_B1_04, identifier: ADD_MUX12, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: K12, peripheral: GPIO1, signal: 'gpio_io, 21', pin_signal: GPIO_AD_B1_05, identifier: ADD_MUX13, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: J13, peripheral: GPIO1, signal: 'gpio_io, 27', pin_signal: GPIO_AD_B1_11, identifier: LED_HGROUP_DATA, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: G12, peripheral: GPIO1, signal: 'gpio_io, 30', pin_signal: GPIO_AD_B1_14, identifier: ADC_GROUP_SELECT_0, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: J14, peripheral: GPIO1, signal: 'gpio_io, 31', pin_signal: GPIO_AD_B1_15, identifier: ADC_GROUP_SELECT_1, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: E7, peripheral: GPIO2, signal: 'gpio_io, 01', pin_signal: GPIO_B0_01, identifier: LED_CELL_CTRL1, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: E8, peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_B0_02, identifier: LED_CELL_CTRL2, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: D8, peripheral: GPIO2, signal: 'gpio_io, 03', pin_signal: GPIO_B0_03, identifier: LED_CELL_CTRL3, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: A11, peripheral: GPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_B1_00, identifier: SINK_DAC_0, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: B11, peripheral: GPIO2, signal: 'gpio_io, 17', pin_signal: GPIO_B1_01, identifier: SINK_DAC_1, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: C11, peripheral: GPIO2, signal: 'gpio_io, 18', pin_signal: GPIO_B1_02, identifier: SINK_DAC_2, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: D11, peripheral: GPIO2, signal: 'gpio_io, 19', pin_signal: GPIO_B1_03, identifier: SINK_DAC_3, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: E12, peripheral: GPIO2, signal: 'gpio_io, 20', pin_signal: GPIO_B1_04, identifier: SINK_DAC_4, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: D12, peripheral: GPIO2, signal: 'gpio_io, 21', pin_signal: GPIO_B1_05, identifier: SINK_DAC_5, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: C12, peripheral: GPIO2, signal: 'gpio_io, 22', pin_signal: GPIO_B1_06, identifier: SINK_DAC_6, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: B12, peripheral: GPIO2, signal: 'gpio_io, 23', pin_signal: GPIO_B1_07, identifier: SINK_DAC_7, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: A12, peripheral: GPIO2, signal: 'gpio_io, 24', pin_signal: GPIO_B1_08, identifier: PD_SHIFT_CLK, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: B13, peripheral: GPIO2, signal: 'gpio_io, 26', pin_signal: GPIO_B1_10, identifier: LED_GROUP_EN, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: C14, peripheral: GPIO2, signal: 'gpio_io, 30', pin_signal: GPIO_B1_14, identifier: PD_SHIFT_DATA, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: C13, peripheral: TMR4, signal: 'TIMER, 3', pin_signal: GPIO_B1_11, identifier: LED_GROUP_CLK}
  - {pin_num: H13, peripheral: GPIO1, signal: 'gpio_io, 24', pin_signal: GPIO_AD_B1_08, identifier: TEST_POINT_1, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: M13, peripheral: GPIO1, signal: 'gpio_io, 25', pin_signal: GPIO_AD_B1_09, identifier: TEST_POINT_2, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
  - {pin_num: L13, peripheral: GPIO1, signal: 'gpio_io, 26', pin_signal: GPIO_AD_B1_10, identifier: TEST_POINT_3, direction: OUTPUT, speed: MHZ_200, slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

