windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           
  CLOCK_EnableClock(kCLOCK_Xbar1);            

  /* GPIO configuration of DEBUG_TP1 on GPIO_AD_B0_14 (pin H14) */
  gpio_pin_config_t DEBUG_TP1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_14 (pin H14) */
  GPIO_PinInit(GPIO1, 14U, &DEBUG_TP1_config);

  /* GPIO configuration of DEBUG_TP2 on GPIO_AD_B0_15 (pin L10) */
  gpio_pin_config_t DEBUG_TP2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_15 (pin L10) */
  GPIO_PinInit(GPIO1, 15U, &DEBUG_TP2_config);

  /* GPIO configuration of ADD_MUX11 on GPIO_AD_B1_03 (pin M12) */
  gpio_pin_config_t ADD_MUX11_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_03 (pin M12) */
  GPIO_PinInit(GPIO1, 19U, &ADD_MUX11_config);

  /* GPIO configuration of ADD_MUX12 on GPIO_AD_B1_04 (pin L12) */
  gpio_pin_config_t ADD_MUX12_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin L12) */
  GPIO_PinInit(GPIO1, 20U, &ADD_MUX12_config);

  /* GPIO configuration of ADD_MUX13 on GPIO_AD_B1_05 (pin K12) */
  gpio_pin_config_t ADD_MUX13_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin K12) */
  GPIO_PinInit(GPIO1, 21U, &ADD_MUX13_config);

  /* GPIO configuration of TEST_POINT_1 on GPIO_AD_B1_08 (pin H13) */
  gpio_pin_config_t TEST_POINT_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_08 (pin H13) */
  GPIO_PinInit(GPIO1, 24U, &TEST_POINT_1_config);

  /* GPIO configuration of TEST_POINT_2 on GPIO_AD_B1_09 (pin M13) */
  gpio_pin_config_t TEST_POINT_2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_09 (pin M13) */
  GPIO_PinInit(GPIO1, 25U, &TEST_POINT_2_config);

  /* GPIO configuration of TEST_POINT_3 on GPIO_AD_B1_10 (pin L13) */
  gpio_pin_config_t TEST_POINT_3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_10 (pin L13) */
  GPIO_PinInit(GPIO1, 26U, &TEST_POINT_3_config);

  /* GPIO configuration of LED_HGROUP_DATA on GPIO_AD_B1_11 (pin J13) */
  gpio_pin_config_t LED_HGROUP_DATA_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_11 (pin J13) */
  GPIO_PinInit(GPIO1, 27U, &LED_HGROUP_DATA_config);

  /* GPIO configuration of ADC_GROUP_SELECT_0 on GPIO_AD_B1_14 (pin G12) */
  gpio_pin_config_t ADC_GROUP_SELECT_0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_14 (pin G12) */
  GPIO_PinInit(GPIO1, 30U, &ADC_GROUP_SELECT_0_config);

  /* GPIO configuration of ADC_GROUP_SELECT_1 on GPIO_AD_B1_15 (pin J14) */
  gpio_pin_config_t ADC_GROUP_SELECT_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_15 (pin J14) */
  GPIO_PinInit(GPIO1, 31U, &ADC_GROUP_SELECT_1_config);

  /* GPIO configuration of LED_CELL_CTRL1 on GPIO_B0_01 (pin E7) */
  gpio_pin_config_t LED_CELL_CTRL1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_01 (pin E7) */
  GPIO_PinInit(GPIO2, 1U, &LED_CELL_CTRL1_config);

  /* GPIO configuration of LED_CELL_CTRL2 on GPIO_B0_02 (pin E8) */
  gpio_pin_config_t LED_CELL_CTRL2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_02 (pin E8) */
  GPIO_PinInit(GPIO2, 2U, &LED_CELL_CTRL2_config);

  /* GPIO configuration of LED_CELL_CTRL3 on GPIO_B0_03 (pin D8) */
  gpio_pin_config_t LED_CELL_CTRL3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_03 (pin D8) */
  GPIO_PinInit(GPIO2, 3U, &LED_CELL_CTRL3_config);

  /* GPIO configuration of SINK_DAC_0 on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t SINK_DAC_0_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &SINK_DAC_0_config);

  /* GPIO configuration of SINK_DAC_1 on GPIO_B1_01 (pin B11) */
  gpio_pin_config_t SINK_DAC_1_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_01 (pin B11) */
  GPIO_PinInit(GPIO2, 17U, &SINK_DAC_1_config);

  /* GPIO configuration of SINK_DAC_2 on GPIO_B1_02 (pin C11) */
  gpio_pin_config_t SINK_DAC_2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_02 (pin C11) */
  GPIO_PinInit(GPIO2, 18U, &SINK_DAC_2_config);

  /* GPIO configuration of SINK_DAC_3 on GPIO_B1_03 (pin D11) */
  gpio_pin_config_t SINK_DAC_3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_03 (pin D11) */
  GPIO_PinInit(GPIO2, 19U, &SINK_DAC_3_config);

